#include <iostream>
// Функция для поиска минимального элемента в векторе
double findMin(double* array, int size) {
    double min = array[0]; // Инициализация минимального значения первым элементом вектора

    // Цикл для прохода по всем элементам вектора
    for (int i = 1; i < size; i++) {
        if (array[i] < min) { // Если текущий элемент меньше текущего минимального значения
            min = array[i]; // Обновляем значение минимального элемента
        }
    }

    return min; // Возвращаем найденное минимальное значение
}

// Функция для вычисления суммы элементов между первым и последним положительными элементами в векторе
double calculateSumBetweenPositive(double * array, int size) {
    int firstPositiveIndex = -1; // Индекс первого положительного элемента
    int lastPositiveIndex = -1; // Индекс последнего положительного элемента
    double sum = 0.0; // Инициализация суммы

    // Цикл для прохода по всем элементам вектора
    for (int i = 0; i < size; i++) {
        if (array[i] > 0) { // Если текущий элемент положительный
            if (firstPositiveIndex == -1) { // Если первый положительный элемент еще не найден
                firstPositiveIndex = i; // Запоминаем индекс первого положительного элемента
            }
            lastPositiveIndex = i; // Запоминаем индекс текущего положительного элемента как последний
        }
    }

    // Если найдены оба положительных элемента и они не совпадают
    if (firstPositiveIndex != -1 && lastPositiveIndex != -1 && lastPositiveIndex > firstPositiveIndex) {
        // Суммируем элементы между первым и последним положительными элементами
        for (int i = firstPositiveIndex + 1; i < lastPositiveIndex; i++) {
            sum += array[i];
        }
    }
    else
    {
        std::cout << "Положительые элементы не найдены или они совпадают, или между неими нет значений" << std::endl;
    }
    return sum; // Возвращаем найденную сумму
}

// Функция для преобразования вектора, перемещая все нулевые элементы в конец
void transformArray(double* array,double* array_two, int size) {
    int t = 0;
    for (int i = 0; i < size; i++) { // Проход по всем элементам вектора
        if (array[i] == 0) { // Если элемент равен нулю
            array_two[t]=array[i]; // Добавляем его в конец преобразованного вектора
            t++;
        }
    }
    for (int i = 0; i < size; i++) { // Проход по всем элементам вектора
        if (array[i] != 0) { // Если элемент не равен нулю
            array_two[t]=array[i]; // Добавляем его в конец преобразованного вектора
            t++;
        }
    } 
    //поскольку тип функции void, то нам не надо возвращать никакого значения, и такая функция называется 'процедура' именно потому что она не возвращает никакого значения
 }
