
#include "Header6.6.h"
#include <Windows.h>
using namespace std;
int main()
{   int n;
    SetConsoleOutputCP(CP_UTF8);
    SetConsoleCP(CP_UTF8);
    cout<<"Введите размер массива чисел: ";
    cin>>n;
    double* array = new double [n];
    double* array_two = new double[n];//обьявляем два массива указателей, с ними проще работать в разных файлах
    //указатели дают только адрес ячейки в которой хранится информация а не копируют ее, при работе с большим колличеством данных это может немного замедлять программу, однако требует меньше оперативной ппмяти на выполнение
    for (int i = 0; i < n; i++) { // Цикл для ввода элементов массива с клавиатуры
        cout<< i+1<<")  Элемент ";
        cin >> array[i];
    }
    double min = findMin(array,n); // Нахождение минимального элемента в массиве
    double sum = calculateSumBetweenPositive(array,n); // Вычисление суммы элементов между первым и последним положительными элементами
    transformArray(array,array_two,n); // Преобразование массива

    // Вывод результатов
    cout << "Минимальный элемент массива: " << min << endl;
    cout << "Сумма элементов между первым и последним положительными элементами: " << sum << endl;
    cout << "Преобразованный массив: ";
    for (int i = 0; i < n; i++) { // Цикл для вывода элементов преобразованного массива
        cout << array_two[i] << " ";
    }
    cout << endl;

    return 0; // Возвращаем 0, что обозначает успешное завершение программы
}
