//Перед сдачей все коментарии удали
//Что бы запустить в онлайн компиляторе просто копируешь тескт этого файла в первый файл онлайн компилятора, а второй файл просто добавляешь там будет кнопка такая
//Что бы запстить в студии надо будет создать новый проект, закинуть этот файл в папку с основными фалами, а второй файл в заголовочные файлы
//В строке в которой добаваляешь в этот файл заголовочный (у меня это 6-ая) Нужно будет прописать не просто название а полный путь до этого файла
#include <windows.h>//Эта библиотека нужна для создания отдельных окон, но мне нужна для 7 и 8 строки
#include "Functions1.h"
using namespace std;//Использование стандартного поля имен
int main ()
{   int n;
    SetConsoleOutputCP(CP_UTF8);//Эти две строки нужны только для моего компилятора 
    SetConsoleCP(CP_UTF8);//Они подключают к консоли кириллицу, точнее кодировку юникода в котором есть киррилица
    cout<<"Введите размер массива чисел: ";
    cin>>n;//Задаем размерность массива, которая потом будет главным ограничением для всех циклов
    double* numbers = new double[n];//создаем два динамических массива, один для первых 2 заданий, другой для фильтрации
    double* numbers_sec = new double[n];
    Nabor_First(numbers,n);//Ну тут уже все понятно, просто по очереди вызываем функции заданные в заголовочнм файле(header  .h)
    Output_nums(numbers,n);
    sum_Otriz(numbers,n);
    First_Last_min(numbers,n);
    Prod_MinMax(numbers,n);
    nabor_sec(numbers,numbers_sec,n);
    Output_nums_sec(numbers_sec,n);
    
    system("pause");//Останавливает выполнение программы, нужно только как задержка перед закрытием окна программы.
}