#include <iostream>
#include <cmath>
#include <windows.h>//Если студия или онлайн компилятор можно удалить
#include <iomanip>//Библиотека для округлений
using namespace std;//использование стандартной библиотеки позволяет не писать каждый раз std::
double x,y,Res,t,k;//Объявление переменных
int i,n;
int main() 
{ 
    SetConsoleOutputCP(CP_UTF8);//аналогично с 3 строкой
    SetConsoleCP(CP_UTF8);
    i=0;
    cout<<"Введите целочисленное n: ";//Важно указать что бы вводили значения соответсвующие типам данных
    cin>>n;
    cout<<"Введите число с плавающей точкой x: ";
    cin>>x;
    t=x;
    i=1;
    while ( i<n+1) // читается как: выполняет цикл ПОКА выполняется условие внутри скобок
        {  
            t=atan(x)+i;//прибавляет к значению t x d степени равной колличеству срабатываний цикла
            y+=i;//Переменная вызывает сама себя, прибавляет к себе 2 и возводит все под корень каждое срабатывание цикла
            Res+=t/y;
            i++;//
        }
cout<<"\n" <<"результат : "<< setprecision(4) <<fixed<<Res<<endl;
system("pause");
}
