#include <iostream> //Библиотека для работы с консолью ввод/вывод
#include <cmath>//Библиотека для сложных математических операций
using namespace std; 
int main() 
{ 

double x, y, R;// объявляем вещественные переменные x, y и R 
int j,k;
for (j=0; j<10;j++)
    {
        cout << "Бросок №"<<j+1<<"/10"<<endl;
        cout << "Введите число для переменной x = "; 
        cin >> x;
        // пользователь присваивает значение(любое кроме букв) для переменной x 
        cout << "Введите число для переменной y = "; 
        cin >> y;
        // пользователь присваивает значение(любое кроме букв) для переменной y 
        if ((x>=0 && y>=0 && y>=pow(x-2,2)-3&& abs(y)<=x )||(x>=0 && y<=0 && y>=pow(x-2,2)-3 && abs(y)>=x))
            {
            cout << "Вы попали в мишень !!!" << endl;//Очевидно вывод результата успешного попадания
            }
        else 
            {
            cout << "Промах !!!" << endl;// Вывод уже неудачного броска
            }
    
    }
system("pause");//Для того что бы в конце цикла консоль просто не закрылась. Выведeтся "Нажмите любую кнопку что бы закрытьь программу". Соответственно при нажатии чего угодно консоль закроется
return 0;//Стандартное завершение цикла, впринципе оно не обязательно тк дальше программы просто нет и программа сама выключится. Это просто информация на всякий
}