#include <iostream> 
#include <cmath>
#include <windows.h>//нужна для строк 8 9
#include <iomanip>//библиотека для нормального округления типа setprecision() И setw()
using namespace std; // Использование стандартной библиотеки сто бы не писать постоянно std:: 
int main() 
{ 
    SetConsoleOutputCP(CP_UTF8);//это и следующая строка впринципе не нужны для студии и онлайн компилятора
    SetConsoleCP(CP_UTF8);//они подключают кириллицу для терминала
    double x, y, R,t;
    int k;
    cout<<"Введите R: ";
    cin>>R;
    cout<<"Введите Диапазон: ";
    cin>>t;
    cout<<"Введите x : ";
    cin>>x;
    if ( x <= -R/2 ) //Каждое условие это отдельный промежууток функции и так или иначе он связан с задаваемым радиусом
        {
            y = -x-R/2; // Что бы было проще понять каждое задданое уравнение достаточно в него подставить наши значения
        }
           
        if (x>=-R/2 && x<=R/2)
        {
            y = 0;
        }
        if (x>R/2 && x<2.5*R)
        {
            y = R*sin(M_PI+M_PI*-(x-1)/(2*R));//мне кажется единственное что у тебя может вызвать затруднение, крч это просто тригонометрия  
        }
        if (x>=2.5*R)
        {
            y = -(x-5)/R;
        }
        else 
        {
            y = 0;
        }
cout << x << "    |     " << y << endl;
    cout <<setw(5)<< "x      |     y"<<endl<<"---------------"<<endl;
    for (x=-t; x<=t;x+=1)
    {
        if ( x <= -R/2 ) //Каждое условие это отдельный промежууток функции и так или иначе он связан с задаваемым радиусом
        {
            y = -x-R/2; // Что бы было проще понять каждое задданое уравнение достаточно в него подставить наши значения
        }
           
        if (x>=-R/2 && x<=R/2)
        {
            y = 0;
        }
        if (x>R/2 && x<2.5*R)
        {
            y = R*sin(M_PI+M_PI*-(x-1)/(2*R));//мне кажется единственное что у тебя может вызвать затруднение, крч это просто тригонометрия  
        }
        if (x>=2.5*R)
        {
            y = -(x-5)/R;
        }
        else 
        {
            y = 0;
        }
        cout<<setw(5)<<x<<setprecision(4) <<"  |  "<<y<<endl<<setw(5)<<"---------------"<<endl;
    }
    
system("pause");
}