#include <iostream> 
#include <cmath>
#include <windows.h>//Библиотека для создания отдельных окон, но я использую ее только для 8 и 9 строчки
#include <iomanip>
using namespace std; 
int main() 
{ 
    SetConsoleOutputCP(CP_UTF8);//эти строчки подключают кодировку юникод-8 нужна для кириллицы
    SetConsoleCP(CP_UTF8);
    double x, y, R,t;
    int k;
    cout<<"Введите R: ";
    cin>>R;
    cout<<"Введите Диапазон: ";//Диапазон на котором от значения 0 принимаются значения x
    cin>>t;
    cout<<"Нужно ввести функцию? 1-да остальное нет ";
    cin>>k;
    cin >>x;
    if ( x <= -R )//промежуток до значения -R по оси x
            {
                y = R;//на нем y принимает значение R(Прямая неизменяющаяся)
            }
            if (x>-R && x<R)//Промежуток на оси х от значения -R до R
            {
                y =  R /*Вот этот R*/ + R*sin(1.5*M_PI+M_PI*x/(2*R));//Тригонометрическая формула отвечающая за нижнюю полуокружность
            } //Поднимает центр окружности на значение R
            if (x>=R&&x<2*R)//соответвенно от R До 2R
            {
                y = 3*R-x*2;//Это Прямая идущая вниз
            }
            if (x>=2*R)
            {
                y = -R*3+x;//прямая но уже идущая вверх
            }
            cout<<setw(5)<<x<<setprecision(4) <<"  |  "<<y<<endl<<setw(5)<<"---------------"<<endl; 
    if (k==1)
    {
       cout <<setw(5)<< "x      |     y"<<endl<<"---------------"<<endl;//Дизайн для красивой таблицы setw()-колличество символов с строке
        for (x=-t; x<=t;x+=0.2)
        {
            if ( x <= -R )//промежуток до значения -R по оси x
            {
                y = R;//на нем y принимает значение R(Прямая неизменяющаяся)
            }
            if (x>-R && x<R)//Промежуток на оси х от значения -R до R
            {
                y =  R /*Вот этот R*/ + R*sin(1.5*M_PI+M_PI*x/(2*R));//Тригонометрическая формула отвечающая за нижнюю полуокружность
            } //Поднимает центр окружности на значение R
            if (x>=R&&x<2*R)//соответвенно от R До 2R
            {
                y = 3*R-x*2;//Это Прямая идущая вниз
            }
            if (x>=2*R)
            {
                y = -R*3+x;//прямая но уже идущая вверх
            }
            cout<<setw(5)<<x<<setprecision(4) <<"  |  "<<y<<endl<<setw(5)<<"---------------"<<endl;
        }                     //setprecision(4) Обозначает округление до 4 символов
    }
    else
    {
        cout<<"Вы решили не решать график";
        return 0;
    } 
system("pause");//В конце выполнения программы вместо закрытия терминала выводит Press any key
}