#include <iostream> //Библиотека для работы с консолью ввод/вывод
#include <cmath>//Библиотека для сложных математических операций
#include <windows.h>//Нужно только мне для добавления кириллицы!ДЛЯ ОНЛАЙН КОМПИЛЯТОРА УДАЛИТЬ
using namespace std; 
int main() 
{ 
SetConsoleOutputCP(CP_UTF8);//Эти двестроки добавляют в консоль ккирилицу если, вдруг она не отображается(как у меня)!ДЛЯ ОНЛАЙН КОМПИЛЯТОРА УДАЛИТЬ
SetConsoleCP(CP_UTF8);
double x, y, R;// объявляем вещественные переменные x, y и R 
int j, k;

for (j=0; j<10;j++)
    {
    cout << "Введите значение R: " ;
    cin >> R;
    cout<<"Бросить дротик? 1-да остальное нет: ";// Нужно что не всегда бросать все 10 бросков, а иногда, выключить программу раньше вермени
    cin>>k;
    if (k==1)
    { 
        cout << "Попытка №"<<j+1<<"/10"<<endl;
        cout << "Введите число для переменной x = "; 
        cin >> x;
        // пользователь присваивает значение(любое кроме букв) для переменной x 
        cout << "Введите число для переменной y = "; 
        cin >> y;
        // пользователь присваивает значение(любое кроме букв) для переменной y 

        if ((x>=-К && y<=0 && (sqrt(y*y+x*x) <=R2 && sqrt(y*y+x*x) >=R1))||(x<=0 && y>=0 && sqrt(x*x+y*y)<=R1))       
            {
            cout << "Попадание" << endl;//Очевидно вывод результата успешного попадания
            }
        else 
            {
            cout << "Промах" << endl;// Вывод уже неудачного броска
            }
    }
    else
        {
        cout<<"Вы решили дальше не кидать"<<endl;//Это выводится при вводе чего угодно кроме 1 когда задается вопрос бросить дротик или нет. А также прерывает функцию с помощью (return(0))
        return 0; 
    }
    }
system("pause");//Для того что бы в конце цикла консоль просто не закрылась. Выведeтся "Нажмите любую кнопку что бы продолжить"
return 0;//Стандартное завершение цикла, впринципе оно не обязательно тк дальше программы просто нет и программа сама выключится. Это просто информация на всякий
}