#include <iostream> 
#include <cmath>
#include <windows.h>//Нужно только мне для добавления кириллицы!ДЛЯ ОНЛАЙН КОМПИЛЯТОРА УДАЛИТЬ
using namespace std; 
int main() 
{ 
SetConsoleOutputCP(CP_UTF8);//Эти двестроки добавляют в консоль ккирилицу если, вдруг она не отображается(как у меня)!ДЛЯ ОНЛАЙН КОМПИЛЯТОРА УДАЛИТЬ
SetConsoleCP(CP_UTF8);
double x, y, R;
for (int j=0; j<10;j++)
    {
        cout << "Бросок №"<<j+1<<"/10"<<endl;
        cout << "Введите число для переменной R = "; 
        cin >> R;
        cout << "Введите число для переменной x = "; 
        cin >> x; 
        cout << "Введите число для переменной y = "; 
        cin >> y;

        if ((x>=-R && y>=0 && x<=R && y<=R*sin(0.5*M_PI+M_PI*x/(R*2)))||(x<=0 && y>=-R && y<=0 && x>=-R && y<=x ))
        
            {
            cout << "Вы попали в мишень !!!" << endl;
            }
        else 
            {
            cout << "Промах" << endl;
            }
    }
system("pause");//Для того что бы в конце цикла консоль просто не закрылась. Выведeтся "Нажмите любую кнопку что бы закрытьь программу". Соответственно при нажатии чего угодно консоль закроется
}