#include <iostream> 
#include <cmath>
#include <windows.h>//Нужно только мне для добавления кириллицы!ДЛЯ ОНЛАЙН КОМПИЛЯТОРА УДАЛИТЬ
using namespace std; 
int main() 
{ 
SetConsoleOutputCP(CP_UTF8);//Эти двестроки добавляют в консоль ккирилицу если, вдруг она не отображается(как у меня)!ДЛЯ ОНЛАЙН КОМПИЛЯТОРА УДАЛИТЬ
SetConsoleCP(CP_UTF8);
double x, y, R;
for (int i=1; i<11;i++)
    {
        cout <<i<<"/10"<<endl;
        cout << "Введите число для переменной R = "; 
        cin >> R;
        cout << "Введите число для переменной x = "; 
        cin >> x; 
        cout << "Введите число для переменной y = "; 
        cin >> y;

        if ((x>=-R && y<=0 && x<=0 && y>=-R+R*sin(M_PI*-x/(R*2)))||(x>=0 && y>=0 && x<=2*R && y<=R*sin(M_PI*x/(R*2) )))
        
            {
            cout << "Вы попали" << endl;
            }
        else 
            {
            cout << "Вы промахнулись" << endl;
            }
    }
system("pause");//Для того что бы в конце цикла консоль просто не закрылась. Выведeтся "Нажмите любую кнопку что бы закрытьь программу". Соответственно при нажатии чего угодно консоль закроется
}