#include <iostream> 
#include <cmath>
#include <windows.h>//Библиотека для создания отдельных окон, но я использую ее только для 8 и 9 строчки
#include <iomanip>
using namespace std; 

int main() 
{ 
    double x, y, R, t, u,m;
    SetConsoleOutputCP(CP_UTF8);//эти строчки подключают кодировку юникод-8 нужна для кириллицы
    SetConsoleCP(CP_UTF8);
    int k;
    cout<<"Введите R: ";
    cin>>u;
    R=fabs(u);
    cout << "Введите значение x: ";
    cin >> x;
    if (x < -R*5)
    {
        y=0;
    }
    if (x >= -R*5&&x<-3*R)
    {
        y=R*(sin(0.5*M_PI+M_PI*x/(2*R)))-R;//В коде будет 2 одинаковых части кода с определением y на графике от x
        //можно было бы использовать функции но по ТЗ мы еще не можем использовать функции
        //единственная строчка которая требует некоторого обьяснения, в общем это тригонометрия, я использую синус для того что бы определять значения окружности
        //Иногда когда синус образует 0(который всегда сложно в програмировании нормально отобразить) он получает не чистый 0 а приближенный к нему e-16(16 знаков после запятой)
        //Иногда он может получить неопределенное значение, которое выглядит как то так е+310 е-390 это очень большое значение и наоборот приближенное к нулю, это все ошибки компилятора
    }
    if (x <= R && x >= -3*R)
    {
        y=x/2+R/2;
    }
    if (x>R&&x<3*R)
    {
        y=0;
    }
    if (x>3*R)
    {
        y=pow(x-3*R,2);//тк как нам нужна прямая зависимость от радиуса я в функции заменил 6 на 3*R(которое на картинке равна 0)
        if (y>R*2)
        {
            y=0;
        }
    }
    cout << setw(5)<<x<<setprecision(4) <<"  |  "<<y<<endl<<setw(5)<<"---------------"<<endl;
    cout << "Введите Диапазон: ";//Диапазон на котором от значения 0 принимаются значения x
    cin >> t;
    cout << "Введите шаг: ";// Шаг с которым будет отбираться х для таблицы
    cin >> m;
    cout << setw(5) << "x      |     y" << endl << "---------------" << endl;//Дизайн для красивой таблицы setw()-колличество символов с строке
    for (x=-t; x<=t;x+=m)
    {
       if (x < -R*5)
    {
        y=0;
    }
    if (x >= -R*5&&x<-3*R)
    {
        y=R*(sin(0.5*M_PI+M_PI*x/(2*R)))-R;
    }
    if (x <= R && x >= -3*R)
    {
        y=x/2+R/2;
    }
    if (x>R&&x<3*R)
    {
        y=0;
    }
    if (x>3*R)
    {
        y=pow(x-3*R,2);
        if (y>R*2)
        {
            y=0;
        }
    }
        cout << setw(5) << x << setprecision(4) <<"  |  "<< y << endl << setw(5)<<"---------------"<<endl;
    }                   //setprecision(4) Обозначает округление до 4 символов 
}
