#include <iostream> 
#include <cmath>
#include <windows.h>//эта библиотека нужна для создания окон но мне она нужна для строчек 10 и 11, они подключают кодировку unicode8
//В ней есть киррилица которая у меня нормально не отображается
#include <iomanip>//Эта библиотека нужна для округления
using namespace std; 

int main() 
{   double l,y,d,t;
    int i,n;
    SetConsoleOutputCP(CP_UTF8);//эти две строчки замени на setlocale если нужно, либо просто удали и замени все русские символы на английские
    SetConsoleCP(CP_UTF8);
    cout<<"Введите целочисленное n: ";
    cin>>n;
    cout<<"Введите число с плавающей точкой x: ";
    cin>>l;
    t=3;
    y=cos(l);
    d=y/t;
    i=1;
    while ( i<n)//по условию было обязательно выполнять через цикл while
        {   //прибавляет к своему значению дроб0ь
           
            y=cos(y);//изначально i=0 следовательно к нулевому значению y добавится 1 (l в степени 0)
            if(i%2<1) t+=3;
            else  t+=5;
            d=d+y/t;
            i++;//постфиксный инкремент
        }
cout<<"\nрезультат при n = "<<n<<" и x = "<< l <<" равен d: "<< setprecision(4) <<fixed<<d<<endl;//вывод
system("pause");
}
