#include <iostream> 
#include <cmath>
#include <windows.h>//эта библиотека нужна для создания окон но мне она нужна для строчек 10 и 11, они подключают кодировку unicode8
//В ней есть киррилица которая у меня нормально не отображается
#include <iomanip>//Эта библиотека нужна для округления
using namespace std; 
double l,y,d,t;
int i,n;
int main() 
{ 
    SetConsoleOutputCP(CP_UTF8);//эти две строчки замени на setlocale если нужно, либо просто удали и замени все русские символы на английские
    SetConsoleCP(CP_UTF8);
    cout<<"Введите целочисленное n: ";
    cin>>n;
    cout<<"Введите число с плавающей точкой x: ";
    cin>>l;
    t=0;
    while ( i<n)//по условию было обязательно выполнять через цикл while
        {    
            y+=pow(l,i);//изначально i=0 следовательно к нулевому значению y добавится 1 (l в степени 0)
            t=sqrt(2+t);//Переменная вызывает сама себя, берет свое значение которое изначально равно так же 0
            d+=y/t;//прибавляет к своему значению дробь
            i++;//постфиксный инкремент
        }
cout<<"\nрезультат при n = "<<n<<" и x = "<< l <<" равен d: "<< setprecision(4) <<fixed<<d<<endl;//вывод
system("pause");
}
