#include <iostream>
#include <cmath>
#include <windows.h>//Если студия или онлайн компилятор можно удалить
#include <iomanip>//Библиотека для округлений
using namespace std; //использование стандартной библиотеки позволяет не писать каждый раз std::
double x,y,Res,t,k;//Объявление переменных
int i,n;
int main() 
{ 
    SetConsoleOutputCP(CP_UTF8);//аналогично с 3 строкой
    SetConsoleCP(CP_UTF8);
    i=0;
    cout<<"Введите целочисленное n: ";//Важно указать что бы вводили значения соответсвующие типам данных
    cin>>n;
    cout<<"Введите число с плавающей точкой x: ";
    cin>>x;
    t=1;//присваиваем переменным начальное значение которое потом будет увеличиваться от n
    Res=0;
    y=1;
    i=0;
    while ( i<n) // читается как: выполняет цикл ПОКА выполняется условие внутри скобок
        {  
            Res+=t/y;
            t+=pow(x,i+1);//Каждое срабатывание цикла числитель добавляет к себе x в степени кол-ва срабатываний цикла
            y=y*(i*2+3);//Переменная вызывает сама себя и умножается на колличество срабатываний цикла умноженное на 2 но уменьшенное на единицу
            i++;//
        }
cout<<"\n" <<"результат : "<< setprecision(4) <<fixed<<Res<<endl;
system("pause");
}
