//Перед сдачей комментарии удали. 
#include <iostream>
#include <windows.h>//подключаю библиотеку для 8 и 9 строчек они нужны чтобы подключить киррилицу
#include "Header6.24.h"//подключаем наш 2-ой файл в котором описываются наши процедуры(функции без return)
//В онлйан компиляторе нужно этот файл скопировать в main.cpp, а Header6.24 только добавить отдельным файлом
//в студии создаешь отдельный проект, в котором этот файл указываешь основным, а второй добавляешь в заголовочные файлы, в 4 строке измени простое название файла на полный путь к этому файлу
using namespace std; //использование стандартной библиотеки std
int main ()
{  int n;
    SetConsoleOutputCP(CP_UTF8);// для этих строчек нужна библиотека windows.h онлайн компилятор эту библиотеку не поддерживает
    SetConsoleCP(CP_UTF8);
    cout<<"Введите размер массива чисел: ";
    cin>>n;
    double* array1 = new double [n];
    double* array2 = new double[n];//создаем ссылку на массив 1 и 2
    Nabor_First(array1,n);//вызываем процедуры описаные в файле-заголовке Header6.24.h
    Output_nums(array1,n);//Эти процедуры вполняются только когда из вызывают, собственно как и функции
    sum_nechet(array1,n);
    First_Last_minus(array1,n);
    Summ_FirstLast(array1,n);
    nabor_sec(array1,array2,n);
    Output_nums_sec(array2,n);
    system("pause");//Вызывает паузу в выполнении программы, но тк эта строка в конце она паузит перед завершением программы
}